## Plan Result (prod - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 15 to add, 2 to change, 9 to destroy.</code></pre>

* Create
  * azurerm_managed_disk.managed_disk[&#34;bastion-ubuntu&#34;]
  * azurerm_managed_disk.managed_disk[&#34;devops-ubuntu&#34;]
  * azurerm_managed_disk.managed_disk[&#34;jenkins-agent&#34;]
  * azurerm_managed_disk.managed_disk[&#34;jenkins-ubuntu&#34;]
  * azurerm_managed_disk.managed_disk[&#34;jenkins-ubuntu-arm&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-ubuntu-arm&#34;]
* Update
  * azurerm_resource_group.image_gallery_rg
  * azurerm_shared_image_gallery.image_gallery
* Replace
  * azurerm_shared_image_version.image_version[&#34;bastion-ubuntu&#34;]
  * azurerm_shared_image_version.image_version[&#34;devops-ubuntu&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-agent&#34;]
  * azurerm_shared_image_version.image_version[&#34;jenkins-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;bastion-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;devops-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-agent&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-ubuntu&#34;]
  * azurerm_snapshot.snapshot[&#34;jenkins-ubuntu-arm&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_managed_disk.managed_disk["bastion-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "bastion-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["devops-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "devops-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["jenkins-agent"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-agent-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["jenkins-ubuntu"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-ubuntu-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_managed_disk.managed_disk["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_managed_disk" "managed_disk" {
      + create_option                 = "Empty"
      + disk_iops_read_only           = (known after apply)
      + disk_iops_read_write          = (known after apply)
      + disk_mbps_read_only           = (known after apply)
      + disk_mbps_read_write          = (known after apply)
      + disk_size_gb                  = 1
      + id                            = (known after apply)
      + location                      = "uksouth"
      + logical_sector_size           = (known after apply)
      + max_shares                    = (known after apply)
      + name                          = "jenkins-ubuntu-arm-disk"
      + public_network_access_enabled = true
      + resource_group_name           = "hmcts-image-gallery-rg"
      + source_uri                    = (known after apply)
      + storage_account_type          = "Standard_LRS"
      + tier                          = (known after apply)
    }

  # azurerm_resource_group.image_gallery_rg will be updated in-place
  ~ resource "azurerm_resource_group" "image_gallery_rg" {
        id         = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg"
        name       = "hmcts-image-gallery-rg"
      ~ tags       = {
            "application"  = "core"
            "builtFrom"    = "hmcts/shared-image-gallery"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          + "startupMode"  = "always"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_shared_image_gallery.image_gallery will be updated in-place
  ~ resource "azurerm_shared_image_gallery" "image_gallery" {
        id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts"
        name                = "hmcts"
      ~ tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/shared-image-gallery"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
          + "startupMode"  = "always"
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_shared_image_version.image_version["bastion-ubuntu"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/bastion-ubuntu/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/bastion-ubuntu-snapshot" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["devops-ubuntu"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/devops-ubuntu/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/devops-ubuntu-snapshot" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["jenkins-agent"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/jenkins-agent/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-agent-snapshot" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["jenkins-ubuntu"] must be replaced
-/+ resource "azurerm_shared_image_version" "image_version" {
      ~ id                  = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/galleries/hmcts/images/jenkins-ubuntu/versions/1.0.0" -> (known after apply)
        name                = "1.0.0"
      ~ os_disk_snapshot_id = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-ubuntu-snapshot" -> (known after apply) # forces replacement
      - tags                = {} -> null
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_shared_image_version.image_version["jenkins-ubuntu-arm"] will be created
  + resource "azurerm_shared_image_version" "image_version" {
      + exclude_from_latest = false
      + gallery_name        = "hmcts"
      + id                  = (known after apply)
      + image_name          = "jenkins-ubuntu-arm"
      + location            = "uksouth"
      + name                = "1.0.0"
      + os_disk_snapshot_id = (known after apply)
      + replication_mode    = "Full"
      + resource_group_name = "hmcts-image-gallery-rg"

      + target_region {
          + name                   = "uksouth"
          + regional_replica_count = 1
          + storage_account_type   = "Standard_LRS"
        }
    }

  # azurerm_snapshot.snapshot["bastion-ubuntu"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/bastion-ubuntu-snapshot" -> (known after apply)
        name                   = "bastion-ubuntu-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/bastion-ubuntu-disk" -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["devops-ubuntu"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/devops-ubuntu-snapshot" -> (known after apply)
        name                   = "devops-ubuntu-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/devops-ubuntu-disk" -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["jenkins-agent"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-agent-snapshot" -> (known after apply)
        name                   = "jenkins-agent-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/jenkins-agent-disk" -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["jenkins-ubuntu"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-ubuntu-snapshot" -> (known after apply)
        name                   = "jenkins-ubuntu-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/jenkins-ubuntu-disk" -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # azurerm_snapshot.snapshot["jenkins-ubuntu-arm"] must be replaced
-/+ resource "azurerm_snapshot" "snapshot" {
      ~ disk_size_gb           = 1 -> (known after apply)
      ~ id                     = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/snapshots/jenkins-ubuntu-arm-snapshot" -> (known after apply)
        name                   = "jenkins-ubuntu-arm-snapshot"
      ~ source_uri             = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/hmcts-image-gallery-rg/providers/Microsoft.Compute/disks/jenkins-ubuntu-arm-disk" -> (known after apply) # forces replacement
      - tags                   = {} -> null
      ~ trusted_launch_enabled = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 15 to add, 2 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":22,"Program":"tfcmt","SHA1":"","Target":"prod - TerraformPlanApply","Vars":{}} -->